export const categories =[
  {
    "name": "איכות סביבה ואקלים",
    "subCategories": [
      {
        "name": "חופים ושמורות טבע"
      },
      {
        "name": "משבר האקלים"
      },
      {
        "name": "שמירה על שטחים פתוחים"
      },
      {
        "name": "היתרים"
      },
      {
        "name": "שמירה על איכות הסביבה"
      },
      {
        "name": "פיקוח ורגולציה"
      },
      {
        "name": "שמירה על המגוון הביולוגי"
      }
    ]
  },
  {
    "name": "ביטחון פנים",
    "subCategories": [
      {
        "name": "תשתיות ביטחון"
      },
      {
        "name": "מדיניות הביטחון הפנימי"
      },
      {
        "name": "מאבק בטרור ופשיעה"
      },
      {
        "name": "שירותי חירום והצלה וגופי ביטחון הפנים"
      },
      {
        "name": "אכיפה בררנית"
      },
      {
        "name": "שמירה על הסדר הציבורי"
      },
      {
        "name": "פשיעה על רקע לאומני"
      },
      {
        "name": "\"מעצר"
      },
      {
        "name": "כליאה ובתי סוהר\""
      },
      {
        "name": "שיוויון"
      },
      {
        "name": "שירות לאזרח"
      }
    ]
  },
  {
    "name": "ביקורת המדינה",
    "subCategories": [
      {
        "name": "שקיפות ואחריות ממשלתית"
      },
      {
        "name": "מנהל תקין"
      },
      {
        "name": "מלחמה בשחיתות"
      },
      {
        "name": "נציבות המדינה"
      },
      {
        "name": "פיקוח וביקורת על גופי המדינה"
      },
      {
        "name": "שיוויון"
      },
      {
        "name": "ועדות חקירה"
      }
    ]
  },
  {
    "name": "בריאות",
    "subCategories": [
      {
        "name": "מדיניות תרופות וחיסונים"
      },
      {
        "name": "מקצועות הבריאות והצוותים הרפואיים"
      },
      {
        "name": "מדיניות בריאות ציבורית"
      },
      {
        "name": "מערכת הבריאות והשירותים הרפואיים"
      },
      {
        "name": "חדשנות רפואית וטכנולוגיה"
      },
      {
        "name": "בריאות הנפש"
      },
      {
        "name": "קידום בריאות"
      },
      {
        "name": "שוויון"
      }
    ]
  },
  {
    "name": "דילמה",
    "subCategories": []
  },
  {
    "name": "דת ומדינה",
    "subCategories": [
      {
        "name": "נישואין וגירושין"
      },
      {
        "name": "שבת"
      },
      {
        "name": "רבנות"
      },
      {
        "name": "כשרות"
      },
      {
        "name": "חינוך"
      },
      {
        "name": "בתי דין דתיים"
      },
      {
        "name": "שירותי דת"
      },
      {
        "name": "שמירה על המקומות הקדושים"
      }
    ]
  },
  {
    "name": "חוץ וביטחון",
    "subCategories": [
      {
        "name": "מילואים"
      },
      {
        "name": "הסכסוך הישראלי-פלסטיני"
      },
      {
        "name": "הגנה על העורף"
      },
      {
        "name": "תנאי שירות והטבות למשוחררים"
      },
      {
        "name": "יחסי חוץ ומדיניות דיפלומטית"
      },
      {
        "name": "הגנה וביטחון לאומי"
      },
      {
        "name": "משא ומתן והסכמים לשלום"
      },
      {
        "name": "מתאם פעולות הממשלה בשטחים והמנהל האזרחי"
      },
      {
        "name": "מלחמה בטרור"
      },
      {
        "name": "סיוע צבאי ושיתופי פעולה בינלאומי"
      },
      {
        "name": "\"יו\"\"ש והפלסטינים\""
      },
      {
        "name": "משפט צבאי"
      },
      {
        "name": "פיקוח ובקרה על גופי הביטחון"
      }
    ]
  },
  {
    "name": "חוק ומשפט",
    "subCategories": [
      {
        "name": "המערכת המשפטית והפרקליטות"
      },
      {
        "name": "זכויות אדם וחירות אזרחית"
      },
      {
        "name": "חוק יסוד"
      },
      {
        "name": "רפורמות משפטיות"
      },
      {
        "name": "הנגשת שירותים משפטיים"
      },
      {
        "name": "דילמה"
      },
      {
        "name": "דיני משפחה"
      },
      {
        "name": "דיני קניין וקניין רוחני"
      },
      {
        "name": "דין פלילי"
      },
      {
        "name": "דיני נזיקין"
      },
      {
        "name": "דיני חוזים וחיובים"
      },
      {
        "name": "דיני חדלות פירעון"
      },
      {
        "name": "דיני תאגידים והגבלים עסקיים"
      },
      {
        "name": "עריכת דין"
      },
      {
        "name": "דיני ירושה"
      },
      {
        "name": "דין מנהלי"
      },
      {
        "name": "\"מח\"\"ש\""
      }
    ]
  },
  {
    "name": "חינוך והשכלה",
    "subCategories": [
      {
        "name": "השכלה גבוהה ומחקר"
      },
      {
        "name": "חדשנות וטכנולוגיה בחינוך"
      },
      {
        "name": "צוות פדגוגי"
      },
      {
        "name": "חינוך לגיל הרך"
      },
      {
        "name": "מדיניות חינוכית ותוכנית פדגוגית"
      },
      {
        "name": "חינוך מיוחד"
      },
      {
        "name": "חינוך בלתי פורמלי"
      },
      {
        "name": "שוויון"
      },
      {
        "name": "רווחה וזכויות התלמיד והסטודנט"
      }
    ]
  },
  {
    "name": "יו\"ש והפלסטינים",
    "subCategories": []
  },
  {
    "name": "כלכלה",
    "subCategories": [
      {
        "name": "מדיניות עבודה ותעסוקה"
      },
      {
        "name": "\"תמיכה בעסקים קטנים"
      },
      {
        "name": "בינוניים ובעצמאיים\""
      },
      {
        "name": "שוויון"
      },
      {
        "name": "קידום טכנולוגיות חדשות וחדשנות"
      },
      {
        "name": "יוקר המחיה"
      },
      {
        "name": "קידום תעשייה ומסחר"
      },
      {
        "name": "פיתוח כלכלי אזורי"
      },
      {
        "name": "\"חקלאות ובע\"\"ח\""
      },
      {
        "name": "דילמה"
      },
      {
        "name": "הגנת הצרכן"
      },
      {
        "name": "פיקוח ורגולציה"
      },
      {
        "name": "הגברת תחרות במשק"
      },
      {
        "name": "\"הסדרת מקצועות"
      },
      {
        "name": "תחומים וענפים\""
      },
      {
        "name": "תיירות"
      }
    ]
  },
  {
    "name": "כספים",
    "subCategories": [
      {
        "name": "מדיניות פיסקלית"
      },
      {
        "name": "רפורמות פיסקליות"
      },
      {
        "name": "מדיניות מס"
      },
      {
        "name": "פיקוח על הוצאות הממשלה"
      },
      {
        "name": "סיוע כלכלי ומענקים"
      },
      {
        "name": "תקציב"
      },
      {
        "name": "שירותים פיננסיים"
      },
      {
        "name": "מדיניות מוניטרית"
      }
    ]
  },
  {
    "name": "מדע וטכנולוגיה",
    "subCategories": [
      {
        "name": "תמיכה בסטארט-אפים וחברות טכנולוגיה"
      },
      {
        "name": "חינוך והכשרה טכנולוגית"
      },
      {
        "name": "חקר ופיתוח בתחומים מדעיים"
      },
      {
        "name": "בקרה על חברות טכנולוגיות"
      }
    ]
  },
  {
    "name": "עלייה קליטה ותפוצות",
    "subCategories": [
      {
        "name": "פרויקטים לקידום קליטת עולים"
      },
      {
        "name": "תמיכה בעולים חדשים"
      },
      {
        "name": "מדיניות עלייה"
      },
      {
        "name": "שילוב עולים בחברה ובשוק העבודה"
      },
      {
        "name": "קשר עם יהדות התפוצות"
      }
    ]
  },
  {
    "name": "פנים",
    "subCategories": [
      {
        "name": "בטיחות ציבורית ומניעת אסונות"
      },
      {
        "name": "מדיניות עירונית ופיתוח מקומי"
      },
      {
        "name": "פתרונות לאתגרי הדיור"
      },
      {
        "name": "תכנון ובנייה"
      },
      {
        "name": "מדיניות כניסה והגירה"
      },
      {
        "name": "רשויות מקומיות"
      },
      {
        "name": "טיפול בבנייה לא חוקית"
      },
      {
        "name": "משבר הדיור"
      },
      {
        "name": "שוויון"
      },
      {
        "name": "מרשם האוכלוסין"
      },
      {
        "name": "מקרקעין"
      }
    ]
  },
  {
    "name": "רווחה",
    "subCategories": [
      {
        "name": "שיפור תנאי עבודה"
      },
      {
        "name": "קידום זכויות עובדים"
      },
      {
        "name": "מדיניות רווחה וביטחון סוציאלי"
      },
      {
        "name": "שירותים חברתיים ותמיכה במעמדות חלשים"
      },
      {
        "name": "שוויון"
      },
      {
        "name": "מענקים וקצבאות"
      }
    ]
  },
  {
    "name": "שוויון",
    "subCategories": [
      {
        "name": "קידום זכויות מיעוטים"
      },
      {
        "name": "ייצוג הולם"
      },
      {
        "name": "שוויון מגדרי"
      },
      {
        "name": "קידום שוויון חברתי וכלכלי"
      },
      {
        "name": "מאבק באפליה וגזענות"
      },
      {
        "name": "צמצום פערים פריפריאלים"
      }
    ]
  },
  {
    "name": "תרבות וספורט",
    "subCategories": [
      {
        "name": "תמיכה באמנים ויוצרים"
      },
      {
        "name": "\"הוקרה"
      },
      {
        "name": "הנצחה וטקסים\""
      },
      {
        "name": "מעורבות ציבורית בתחום התרבות והספורט"
      },
      {
        "name": "הנגשת תרבות לציבור הרחב"
      },
      {
        "name": "קידום ספורט ופעילות גופנית"
      },
      {
        "name": "שימור מורשת"
      },
      {
        "name": "הסדרת מקצועות וענפי ספורט"
      },
      {
        "name": "ימים לאומיים"
      }
    ]
  },
  {
    "name": "תשתיות ותחבורה",
    "subCategories": [
      {
        "name": "תשתיות תחבורה"
      },
      {
        "name": "בטיחות בדרכים"
      },
      {
        "name": "תקשורת"
      },
      {
        "name": "שיוויון"
      },
      {
        "name": "פיתוח היישוב"
      },
      {
        "name": "תחבורה ציבורית"
      },
      {
        "name": "משק האנרגיה"
      },
      {
        "name": "פקודות וחוקי תעבורה"
      },
      {
        "name": "משק המים"
      },
      {
        "name": "\" תעופה"
      },
      {
        "name": "ימאות ורכב\""
      }
    ]
  }
]